final List<Map<String, dynamic>> animals = [
  {
    'si': 'බඩවුන්',
    'ta': 'பசு',
    'en': 'Cow',
    'emoji': '🐄',
    'actions': [
      {'si': 'බඩවුන් මෙහෙවිම', 'ta': 'பசு கூப்பிடு', 'en': 'Call cow'},
      {'si': 'බඩවුන් ස්පර්ශ කරන්න', 'ta': 'பசு தொடு', 'en': 'Pet cow'},
      {'si': 'බඩවුන්ගේ හඬ', 'ta': 'பசு கறு', 'en': 'Cow sound'}
    ]
  },
  {
    'si': 'බිතුන්',
    'ta': 'நாய்',
    'en': 'Dog',
    'emoji': '🐕',
    'actions': [
      {'si': 'බිතුන් කෑ', 'ta': 'நாய் சாப்பிடு', 'en': 'Feed dog'},
      {'si': 'බිතුන් සේල', 'ta': 'நாய் விளையாடு', 'en': 'Play with dog'},
      {'si': 'බිතුන්ගේ හඬ', 'ta': 'நாய் குரல்', 'en': 'Dog bark'}
    ]
  },
  {
    'si': 'පූසා',
    'ta': 'பூனை',
    'en': 'Cat',
    'emoji': '🐱',
    'actions': [
      {'si': 'පූසා ස්පර්ශ කරන්න', 'ta': 'பூனை தொடு', 'en': 'Pet cat'},
      {'si': 'පූසා කෑ', 'ta': 'பூனை சாப்பிடு', 'en': 'Feed cat'},
      {'si': 'පූසාගේ හඬ', 'ta': 'பூனை குரல்', 'en': 'Cat sound'}
    ]
  },
  {
    'si': 'හිටිනැටිනා',
    'ta': 'பாம்பு',
    'en': 'Snake',
    'emoji': '🐍',
    'actions': [
      {'si': 'හිටිනැටිනා ගමනය', 'ta': 'பாம்பு நடை', 'en': 'Snake move'},
      {'si': 'හිටිනැටිනා ස්පර්ශ', 'ta': 'பாம்பு தொடு', 'en': 'Touch snake'},
      {'si': 'හිටිනැටිනා හඬ', 'ta': 'பாம்பு உரக்க', 'en': 'Snake hiss'}
    ]
  },
  {
    'si': 'වඩුරා',
    'ta': 'பட்டம்',
    'en': 'Bird',
    'emoji': '🐦',
    'actions': [
      {'si': 'වඩුරා ගිණිසීම', 'ta': 'பட்டம் பாடு', 'en': 'Bird sing'},
      {'si': 'වඩුරා කෑ', 'ta': 'பட்டம் சாப்பிடு', 'en': 'Feed bird'},
      {'si': 'වඩුරා පියාසර', 'ta': 'பட்டம் பறக்க', 'en': 'Bird fly'}
    ]
  },
  {
    'si': 'මසුන්',
    'ta': 'மீன்',
    'en': 'Fish',
    'emoji': '🐟',
    'actions': [
      {'si': 'මසුන් සඳහා ගිණිසි', 'ta': 'மீன் மдய', 'en': 'Fish swim'},
      {'si': 'මසුන් කෑ', 'ta': 'மீன் சாப்பிடு', 'en': 'Feed fish'},
      {'si': 'මසුන් ස්පර්ශ', 'ta': 'மீன் தொடு', 'en': 'Touch fish'}
    ]
  },
  {
    'si': 'ගජා',
    'ta': 'யானை',
    'en': 'Elephant',
    'emoji': '🐘',
    'actions': [
      {'si': 'ගජා ගමනය', 'ta': 'யானை நடை', 'en': 'Elephant walk'},
      {'si': 'ගජා ස්පර්ශ', 'ta': 'யானை தொடு', 'en': 'Touch elephant'},
      {'si': 'ගජා කෑ', 'ta': 'யானை சாப்பிடு', 'en': 'Feed elephant'}
    ]
  },
  {
    'si': 'සිංහ',
    'ta': 'சிங்கம்',
    'en': 'Lion',
    'emoji': '🦁',
    'actions': [
      {'si': 'සිංහ ගර්ජනය', 'ta': 'சிங்கம் கர்ர', 'en': 'Lion roar'},
      {'si': 'සිංහ ගමනය', 'ta': 'சிங்கம் நடை', 'en': 'Lion walk'},
      {'si': 'සිංහ කෑ', 'ta': 'சிங்கம் சாப்பிடு', 'en': 'Lion eat'}
    ]
  },
];
