final List<Map<String, dynamic>> colorsNumbers = [
  {
    'si': 'රතු',
    'ta': 'சிவப்பு',
    'en': 'Red',
    'emoji': '🔴',
    'actions': [
      {'si': 'රතු දෙකිතින්න', 'ta': 'சிவப்பு காட்ட', 'en': 'Show red'},
      {'si': 'රතු සොයන්න', 'ta': 'சிவப்பு தேடு', 'en': 'Find red'},
      {'si': 'රතු ස්පර්ශ', 'ta': 'சிவப்பு தொடு', 'en': 'Touch red'}
    ]
  },
  {
    'si': 'නිල්',
    'ta': 'நீலம்',
    'en': 'Blue',
    'emoji': '🔵',
    'actions': [
      {'si': 'නිල් දෙකිතින්න', 'ta': 'நீலம் காட்ட', 'en': 'Show blue'},
      {'si': 'නිල් සොයන්න', 'ta': 'நீலம் தேடு', 'en': 'Find blue'},
      {'si': 'නිල් ස්පර්ශ', 'ta': 'நீலம் தொடு', 'en': 'Touch blue'}
    ]
  },
  {
    'si': 'කහ',
    'ta': 'மஞ்சள்',
    'en': 'Yellow',
    'emoji': '🟡',
    'actions': [
      {'si': 'කහ දෙකිතින්න', 'ta': 'மஞ்சள் காட்ட', 'en': 'Show yellow'},
      {'si': 'කහ සොයන්න', 'ta': 'மஞ்சள் தேடு', 'en': 'Find yellow'},
      {'si': 'කහ ස්පර්ශ', 'ta': 'மஞ்சள் தொடு', 'en': 'Touch yellow'}
    ]
  },
  {
    'si': 'ගිරවෙ',
    'ta': 'பச்சை',
    'en': 'Green',
    'emoji': '🟢',
    'actions': [
      {'si': 'ගිරවෙ දෙකිතින්න', 'ta': 'பச்சை காட்ட', 'en': 'Show green'},
      {'si': 'ගිරවෙ සොයන්න', 'ta': 'பச்சை தேடு', 'en': 'Find green'},
      {'si': 'ගිරවෙ ස්පර්ශ', 'ta': 'பச்சை தொடு', 'en': 'Touch green'}
    ]
  },
  {
    'si': 'එක',
    'ta': 'ஒன்று',
    'en': 'One',
    'emoji': '1️⃣',
    'actions': [
      {'si': 'එක ගණන් කරන්න', 'ta': 'ஒன்று எண்ண', 'en': 'Count one'},
      {'si': 'එක දෙකිතින්න', 'ta': 'ஒன்று காட்ட', 'en': 'Show one'},
      {'si': 'එක ස්පර්ශ', 'ta': 'ஒன்று தொடு', 'en': 'Touch one'}
    ]
  },
  {
    'si': 'දෙක',
    'ta': 'இரண்டு',
    'en': 'Two',
    'emoji': '2️⃣',
    'actions': [
      {'si': 'දෙක ගණන් කරන්න', 'ta': 'இரண்டு எண்ண', 'en': 'Count two'},
      {'si': 'දෙක දෙකිතින්න', 'ta': 'இரண்டு காட்ட', 'en': 'Show two'},
      {'si': 'දෙක ස්පර්ශ', 'ta': 'இரண்டு தொடு', 'en': 'Touch two'}
    ]
  },
  {
    'si': 'තුන',
    'ta': 'மூன்று',
    'en': 'Three',
    'emoji': '3️⃣',
    'actions': [
      {'si': 'තුන ගණන් කරන්න', 'ta': 'மூன்று எண்ண', 'en': 'Count three'},
      {'si': 'තුන දෙකිතින්න', 'ta': 'மூன்று காட்ட', 'en': 'Show three'},
      {'si': 'තුන ස්පර්ශ', 'ta': 'மூன்று தொடு', 'en': 'Touch three'}
    ]
  },
  {
    'si': 'හතර',
    'ta': 'நான்கு',
    'en': 'Four',
    'emoji': '4️⃣',
    'actions': [
      {'si': 'හතර ගණන් කරන්න', 'ta': 'நான்கு எண்ண', 'en': 'Count four'},
      {'si': 'හතර දෙකිතින්න', 'ta': 'நான்கு காட்ட', 'en': 'Show four'},
      {'si': 'හතර ස්පර්ශ', 'ta': 'நான்கு தொடு', 'en': 'Touch four'}
    ]
  },
];
