final List<Map<String, dynamic>> feelings = [
  {
    'si': 'සතුටුයි',
    'ta': 'மகிழ்ச்சி',
    'en': 'Happy',
    'emoji': '😊',
    'actions': [
      {
        'si': 'සතුටු සිනාසුනෙන්න',
        'ta': 'மகிழ்ச்சி சிரி',
        'en': 'Smile happy'
      },
      {'si': 'සතුටු නැටුම', 'ta': 'மகிழ்ச்சி நாட்டம்', 'en': 'Dance happy'},
      {'si': 'සතුටු කෝරස්', 'ta': 'மகிழ்ச்சி ஆட', 'en': 'Cheer happy'}
    ]
  },
  {
    'si': 'දුකයි',
    'ta': 'சோகம்',
    'en': 'Sad',
    'emoji': '😢',
    'actions': [
      {'si': 'දුක් කඳුළු', 'ta': 'சோகம் கண்ணீர்', 'en': 'Cry sad'},
      {'si': 'දුක් මුහුණ', 'ta': 'சோகம் முகம்', 'en': 'Sad face'},
      {'si': 'දුක් සිතින්න', 'ta': 'சோகம் நினை', 'en': 'Think sad'}
    ]
  },
  {
    'si': 'කෝපයි',
    'ta': 'கோபம்',
    'en': 'Angry',
    'emoji': '😠',
    'actions': [
      {'si': 'කෝපී හඬ', 'ta': 'கோபம் குரல்', 'en': 'Angry shout'},
      {'si': 'කෝපී මුහුණ', 'ta': 'கோபம் முகம்', 'en': 'Angry face'},
      {'si': 'කෝපී පහරදීම', 'ta': 'கோபம் அடி', 'en': 'Angry hit'}
    ]
  },
  {
    'si': 'බයයි',
    'ta': 'பயம்',
    'en': 'Scared',
    'emoji': '😨',
    'actions': [
      {'si': 'බිය මුහුණ', 'ta': 'பயம் முகம்', 'en': 'Scared face'},
      {'si': 'බිය සිතින්න', 'ta': 'பயம் நினை', 'en': 'Think scared'},
      {'si': 'බිය සඳහා ගිණිසි', 'ta': 'பயம் உட்கார', 'en': 'Sit scared'}
    ]
  },
  {
    'si': 'තෙහෙට්ටුයි',
    'ta': 'சோர்வு',
    'en': 'Tired',
    'emoji': '😴',
    'actions': [
      {'si': 'තෙහෙට්ටු නිදුණු', 'ta': 'சோர்வு உறங்கு', 'en': 'Sleep tired'},
      {'si': 'තෙහෙට්ටු මුහුණ', 'ta': 'சோர்வு முகம்', 'en': 'Tired face'},
      {'si': 'තෙහෙට්ටු ඇස', 'ta': 'சோர்வு கண்', 'en': 'Tired eyes'}
    ]
  },
  {
    'si': 'ශීතල',
    'ta': 'குளிர்',
    'en': 'Cold',
    'emoji': '❄️',
    'actions': [
      {'si': 'ශීතල කම්පනය', 'ta': 'குளிர் நடுங்கு', 'en': 'Shiver cold'},
      {'si': 'ශීතල මුහුණ', 'ta': 'குளிர் முகம்', 'en': 'Cold face'},
      {'si': 'ශීතල ඇඳුම්', 'ta': 'குளிர் உடை', 'en': 'Cold clothes'}
    ]
  },
  {
    'si': 'උණුසුම්',
    'ta': 'வெப்பம்',
    'en': 'Hot',
    'emoji': '🔥',
    'actions': [
      {'si': 'උණුසුම් හෙම්බරුම', 'ta': 'வெப்பம் எழுச్', 'en': 'Sweat hot'},
      {'si': 'උණුසුම් පරිවර්තනය', 'ta': 'வெப்பம் ওহ్', 'en': 'Hot face'},
      {'si': 'උණුසුම් ජලය', 'ta': 'வெப்பம் தண்ணீர்', 'en': 'Hot water'}
    ]
  },
  {
    'si': 'කර්පණ්‍යතා',
    'ta': 'பசி',
    'en': 'Hungry',
    'emoji': '😋',
    'actions': [
      {'si': 'පසුබිම කෑම', 'ta': 'பசி சாப்பிடு', 'en': 'Eat hungry'},
      {'si': 'පසුබිම මුහුණ', 'ta': 'பசி முகம்', 'en': 'Hungry face'},
      {'si': 'පසුබිම විකාශ', 'ta': 'பசி வாயேறு', 'en': 'Hungry mouth'}
    ]
  },
];
