final List<Map<String, dynamic>> food = [
  {
    'si': 'බත්',
    'ta': 'சோறு',
    'en': 'Rice',
    'emoji': '🍚',
    'actions': [
      {'si': 'බත් කනවා', 'ta': 'சோறு சாப்பிடு', 'en': 'Eat rice'},
      {'si': 'බත් පිසින්න', 'ta': 'சோறு சமை', 'en': 'Cook rice'},
      {'si': 'බත් ස්පර්ශ', 'ta': 'சோறு தொடு', 'en': 'Touch rice'}
    ]
  },
  {
    'si': 'රොටි',
    'ta': 'ரொட்டி',
    'en': 'Bread',
    'emoji': '🍞',
    'actions': [
      {'si': 'රොටි කනවා', 'ta': 'ரொட்டி சாப்பிடு', 'en': 'Eat bread'},
      {'si': 'රොටි කෙටි', 'ta': 'ரொட்டி வெட்ட', 'en': 'Cut bread'},
      {'si': 'රොටි ස්පර්ශ', 'ta': 'ரொட்டி தொடு', 'en': 'Touch bread'}
    ]
  },
  {
    'si': 'බිස්කට්',
    'ta': 'பிஸ்கட்',
    'en': 'Biscuit',
    'emoji': '🍪',
    'actions': [
      {'si': 'බිස්කට් කනවා', 'ta': 'பிஸ்கட் சாப்பிடு', 'en': 'Eat biscuit'},
      {
        'si': 'බිස්කට් කර්පණ්‍ය',
        'ta': 'பிஸ்கட் சுவையான',
        'en': 'Tasty biscuit'
      },
      {'si': 'බිස්කට් ස්පර්ශ', 'ta': 'பிஸ்கட் தொடு', 'en': 'Touch biscuit'}
    ]
  },
  {
    'si': 'බඩ',
    'ta': 'முட்டை',
    'en': 'Egg',
    'emoji': '🥚',
    'actions': [
      {'si': 'බඩ පිසින්න', 'ta': 'முட்டை சமை', 'en': 'Cook egg'},
      {'si': 'බඩ කනවා', 'ta': 'முட்டை சாப்பிடு', 'en': 'Eat egg'},
      {'si': 'බඩ ස්පර්ශ', 'ta': 'முட்டை தொடு', 'en': 'Touch egg'}
    ]
  },
  {
    'si': 'සුපු',
    'ta': 'சூப்',
    'en': 'Soup',
    'emoji': '🍲',
    'actions': [
      {'si': 'සුපු උණුසුම්', 'ta': 'சூப் சூடான', 'en': 'Hot soup'},
      {'si': 'සුපු පානය', 'ta': 'சூப் குடிக்க', 'en': 'Drink soup'},
      {'si': 'සුපු ස්පර්ශ', 'ta': 'சூப் தொடு', 'en': 'Touch soup'}
    ]
  },
  {
    'si': 'මාස',
    'ta': 'மாமிச',
    'en': 'Meat',
    'emoji': '🍗',
    'actions': [
      {'si': 'මාස කනවා', 'ta': 'மாமிச சாப்பிடு', 'en': 'Eat meat'},
      {'si': 'මාස පිසින්න', 'ta': 'மாமிச சமை', 'en': 'Cook meat'},
      {'si': 'මාස ස්පර්ශ', 'ta': 'மாமிச தொடு', 'en': 'Touch meat'}
    ]
  },
  {
    'si': 'වතුර',
    'ta': 'தண்ணீர்',
    'en': 'Water',
    'emoji': '💧',
    'actions': [
      {'si': 'වතුර හීස්තින්න', 'ta': 'தண்ணீர் குடிக்க', 'en': 'Drink water'},
      {'si': 'වතුර ශීතල', 'ta': 'தண்ணீர் குளிர்', 'en': 'Cold water'},
      {'si': 'වතුර උණුසුම්', 'ta': 'தண்ணீர் சூடான', 'en': 'Hot water'}
    ]
  },
  {
    'si': 'කිරි',
    'ta': 'பால்',
    'en': 'Milk',
    'emoji': '🥛',
    'actions': [
      {'si': 'කිරි හීස්තින්න', 'ta': 'பால் குடிக்க', 'en': 'Drink milk'},
      {'si': 'කිරි උණුසුම්', 'ta': 'பால் சூடான', 'en': 'Warm milk'},
      {'si': 'කිරි ස්පර්ශ', 'ta': 'பால் தொடு', 'en': 'Touch milk'}
    ]
  },
];
