final List<Map<String, dynamic>> needs = [
  {
    'si': 'කන්න ඕනා',
    'ta': 'சாப்பிட வேண்டும்',
    'en': 'Want to eat',
    'emoji': '🍴',
    'actions': [
      {'si': 'කෑම අවශ්‍යයි', 'ta': 'உணவு வேண்டும்', 'en': 'I want food'},
      {'si': 'බත් කනවා', 'ta': 'சோறு சாப்பிடு', 'en': 'Eat rice'},
      {'si': 'සුවඳ කනවා', 'ta': 'சுவண்ட கනవා', 'en': 'Tasty food'}
    ]
  },
  {
    'si': 'බොන්න ඕනා',
    'ta': 'குடிக்க வேண்டும்',
    'en': 'Want to drink',
    'emoji': '🥤',
    'actions': [
      {'si': 'වතුර අවශ්‍යයි', 'ta': 'தண்ணீர் வேண்டும்', 'en': 'I want water'},
      {'si': 'කිරි හීස්තින්න', 'ta': 'பால் குடிக்க', 'en': 'Drink milk'},
      {'si': 'ශීතල බීම', 'ta': 'குளிர் பானம்', 'en': 'Cold drink'}
    ]
  },
  {
    'si': 'නාන්න ඕනා',
    'ta': 'குளிக்க வேண்டும்',
    'en': 'Want to bathe',
    'emoji': '🚿',
    'actions': [
      {'si': 'නාන්න අවශ්‍යයි', 'ta': 'குளிக்க வேண்டும்', 'en': 'I need bath'},
      {'si': 'උණුසුම් වතුර', 'ta': 'சூடான தண்ணீர்', 'en': 'Warm water'},
      {'si': 'සබු භාවිතයි', 'ta': 'சோப்பு உபயோგம்', 'en': 'Use soap'}
    ]
  },
  {
    'si': 'නිදාගන්න',
    'ta': 'தூங்க',
    'en': 'Sleep',
    'emoji': '😴',
    'actions': [
      {'si': 'නිදුණු යෑම', 'ta': 'தூங்கு போ', 'en': 'Go sleep'},
      {'si': 'නිදුණු ඔසවා දිනුම්', 'ta': 'தூங்கு எல்லே', 'en': 'Wake up'},
      {'si': 'නිදුණු ගවේසන', 'ta': 'தூங்கு பேசு', 'en': 'Sleep talk'}
    ]
  },
  {
    'si': 'උදව් ඕනා',
    'ta': 'உதவி வேண்டும்',
    'en': 'Need help',
    'emoji': '🆘',
    'actions': [
      {'si': 'උදව් කරන්න ඉවසා', 'ta': 'உதவி சொல்லা', 'en': 'Please help'},
      {'si': 'කුමක් සිදුවුණේ', 'ta': 'என்ன நடந்தது', 'en': 'What happened'},
      {
        'si': 'ඔබ අවශ්‍ය දෙයි',
        'ta': 'மీరు ఏమి చేదు',
        'en': 'What do you need'
      }
    ]
  },
];
