final List<Map<String, dynamic>> numbers = [
  {
    'si': 'එක',
    'ta': 'ஒன்று',
    'en': 'One',
    'emoji': '1️⃣',
    'actions': [
      {'si': 'එක ගණන් කරන්න', 'ta': 'ஒன்று எண்ண', 'en': 'Count one'},
      {'si': 'එක දෙකිතින්න', 'ta': 'ஒன்று காட்ட', 'en': 'Show one'},
      {'si': 'එක ස්පර්ශ', 'ta': 'ஒன்று தொடு', 'en': 'Touch one'}
    ]
  },
  {
    'si': 'දෙක',
    'ta': 'இரண்டு',
    'en': 'Two',
    'emoji': '2️⃣',
    'actions': [
      {'si': 'දෙක ගණන් කරන්න', 'ta': 'இரண்டு எண்ண', 'en': 'Count two'},
      {'si': 'දෙක දෙකිතින්න', 'ta': 'இரண்டு காட்ட', 'en': 'Show two'},
      {'si': 'දෙක ස්පර්ශ', 'ta': 'இரண்டு தொடு', 'en': 'Touch two'}
    ]
  },
  {
    'si': 'තුන',
    'ta': 'மூன்று',
    'en': 'Three',
    'emoji': '3️⃣',
    'actions': [
      {'si': 'තුන ගණන් කරන්න', 'ta': 'மூன்று எண்ண', 'en': 'Count three'},
      {'si': 'තුන දෙකිතින්න', 'ta': 'மூன்று காட்ட', 'en': 'Show three'},
      {'si': 'තුන ස්පර්ශ', 'ta': 'மூன்று தொடு', 'en': 'Touch three'}
    ]
  },
  {
    'si': 'හතර',
    'ta': 'நான்கு',
    'en': 'Four',
    'emoji': '4️⃣',
    'actions': [
      {'si': 'හතර ගණන් කරන්න', 'ta': 'நான்கு எண்ண', 'en': 'Count four'},
      {'si': 'හතර දෙකිතින්න', 'ta': 'நான்கு காட்ட', 'en': 'Show four'},
      {'si': 'හතර ස්පර්ශ', 'ta': 'நான்கு தொடு', 'en': 'Touch four'}
    ]
  },
  {
    'si': 'පස',
    'ta': 'ஐந்து',
    'en': 'Five',
    'emoji': '5️⃣',
    'actions': [
      {'si': 'පස ගණන් කරන්න', 'ta': 'ஐந்து எண்ண', 'en': 'Count five'},
      {'si': 'පස දෙකිතින්න', 'ta': 'ஐந்து காட்ட', 'en': 'Show five'},
      {'si': 'පස ස්පර්ශ', 'ta': 'ஐந்து தொடு', 'en': 'Touch five'}
    ]
  },
  {
    'si': 'හයි',
    'ta': 'ஆறு',
    'en': 'Six',
    'emoji': '6️⃣',
    'actions': [
      {'si': 'හයි ගණන් කරන්න', 'ta': 'ஆறு எண்ண', 'en': 'Count six'},
      {'si': 'හයි දෙකිතින්න', 'ta': 'ஆறு காட்ட', 'en': 'Show six'},
      {'si': 'හයි ස්පර්ශ', 'ta': 'ஆறு தொடு', 'en': 'Touch six'}
    ]
  },
  {
    'si': 'හත',
    'ta': 'ஏழு',
    'en': 'Seven',
    'emoji': '7️⃣',
    'actions': [
      {'si': 'හත ගණන් කරන්න', 'ta': 'ஏழு எண்ண', 'en': 'Count seven'},
      {'si': 'හත දෙකිතින්න', 'ta': 'ஏழு காட்ட', 'en': 'Show seven'},
      {'si': 'හත ස්පර්ශ', 'ta': 'ஏழு தொடு', 'en': 'Touch seven'}
    ]
  },
  {
    'si': 'අට',
    'ta': 'எட்டு',
    'en': 'Eight',
    'emoji': '8️⃣',
    'actions': [
      {'si': 'අට ගණන් කරන්න', 'ta': 'எட்டு எண்ண', 'en': 'Count eight'},
      {'si': 'අට දෙකිතින්න', 'ta': 'எட்டு காட்ட', 'en': 'Show eight'},
      {'si': 'අට ස්පර්ශ', 'ta': 'எட்டு தொடு', 'en': 'Touch eight'}
    ]
  },
  {
    'si': 'නවය',
    'ta': 'ஒன்பது',
    'en': 'Nine',
    'emoji': '9️⃣',
    'actions': [
      {'si': 'නවය ගණන් කරන්න', 'ta': 'ஒன்பது எண்ண', 'en': 'Count nine'},
      {'si': 'නවය දෙකිතින්න', 'ta': 'ஒன்பது காட்ட', 'en': 'Show nine'},
      {'si': 'නවය ස්පර්ශ', 'ta': 'ஒன்பது தொடு', 'en': 'Touch nine'}
    ]
  },
  {
    'si': 'දහය',
    'ta': 'பத்து',
    'en': 'Ten',
    'emoji': '🔟',
    'actions': [
      {'si': 'දහය ගණන් කරන්න', 'ta': 'பத்து எண்ண', 'en': 'Count ten'},
      {'si': 'දහය දෙකිතින්න', 'ta': 'பத்து காட்ட', 'en': 'Show ten'},
      {'si': 'දහය ස්පර්ශ', 'ta': 'பத்து தொடு', 'en': 'Touch ten'}
    ]
  },
];
