final List<Map<String, dynamic>> objects = [
  {
    'si': 'පොත',
    'ta': 'புத்தகம்',
    'en': 'Book',
    'emoji': '📚',
    'actions': [
      {'si': 'පොත කියවන්න', 'ta': 'புத்தகம் படி', 'en': 'Read book'},
      {'si': 'පොත විවෘත කරන්න', 'ta': 'புத்தகம் திறக்க', 'en': 'Open book'},
      {'si': 'පොත ස්පර්ශ', 'ta': 'புத்தகம் தொடு', 'en': 'Touch book'}
    ]
  },
  {
    'si': 'බෝල',
    'ta': 'பந்து',
    'en': 'Ball',
    'emoji': '⚽',
    'actions': [
      {'si': 'බෝල වලිතට දමන්න', 'ta': 'பந்து தூக்க', 'en': 'Throw ball'},
      {'si': 'බෝල පිඩිසි කරන්න', 'ta': 'பந்து உருட்ட', 'en': 'Roll ball'},
      {'si': 'බෝල ස්පර්ශ', 'ta': 'பந்து தொடு', 'en': 'Touch ball'}
    ]
  },
  {
    'si': 'කුඩ',
    'ta': 'குடை',
    'en': 'Cup',
    'emoji': '☕',
    'actions': [
      {'si': 'කුඩ අරින්න', 'ta': 'குடை பிடி', 'en': 'Hold cup'},
      {'si': 'කුඩ පිරින්න', 'ta': 'குடை நிரப்பு', 'en': 'Fill cup'},
      {'si': 'කුඩ හීස්තින්න', 'ta': 'குடை குடிக்க', 'en': 'Drink from cup'}
    ]
  },
  {
    'si': 'පැන්සල්',
    'ta': 'பென்சில்',
    'en': 'Pencil',
    'emoji': '✏️',
    'actions': [
      {'si': 'පැන්සල් අරින්න', 'ta': 'பென்சில் பிடி', 'en': 'Hold pencil'},
      {'si': 'පැන්සල් ලිවීම', 'ta': 'பென்சில் எழுது', 'en': 'Write pencil'},
      {'si': 'පැන්සල් ස්පර්ශ', 'ta': 'பென்சில் தொடு', 'en': 'Touch pencil'}
    ]
  },
  {
    'si': 'තුවාලුකු',
    'ta': 'மெழுகுவர்த்தி',
    'en': 'Candle',
    'emoji': '🕯️',
    'actions': [
      {
        'si': 'තුවාලුකු ඉතුණු',
        'ta': 'மெழுகுவர்த்தி எரி',
        'en': 'Light candle'
      },
      {
        'si': 'තුවාලුකු ස්පර්ශ',
        'ta': 'மெழுகுவர்த்தி தொடு',
        'en': 'Touch candle'
      },
      {'si': 'තුවාලුකු තලාඩු', 'ta': 'மெழுகுவர்த்தி அணை', 'en': 'Blow candle'}
    ]
  },
  {
    'si': 'දිලි',
    'ta': 'விளக்கு',
    'en': 'Light',
    'emoji': '💡',
    'actions': [
      {'si': 'දිලි දල්', 'ta': 'விளக்கு இயக்க', 'en': 'Turn on light'},
      {'si': 'දිලි බඳ', 'ta': 'விளக்கு அணை', 'en': 'Turn off light'},
      {'si': 'දිලි ස්පර්ශ', 'ta': 'விளக்கு தொடு', 'en': 'Touch light'}
    ]
  },
  {
    'si': 'සිටුවම්',
    'ta': 'நாற்காலி',
    'en': 'Chair',
    'emoji': '🪑',
    'actions': [
      {'si': 'සිටුවම් ගිණිසි', 'ta': 'நாற்காலி உட்கார', 'en': 'Sit on chair'},
      {'si': 'සිටුවම් ස්පර්ශ', 'ta': 'நாற்காலி தொடு', 'en': 'Touch chair'},
      {'si': 'සිටුවම් ගිණිසි නැතිවීම', 'ta': 'நாற்காலி எழு', 'en': 'Stand up'}
    ]
  },
  {
    'si': 'මේස',
    'ta': 'மேज்',
    'en': 'Table',
    'emoji': '🪑',
    'actions': [
      {'si': 'මේස උඩින් දැමුණු', 'ta': 'மேज் மீது வை', 'en': 'Put on table'},
      {'si': 'මේස ස්පර්ශ', 'ta': 'மேज் தொடு', 'en': 'Touch table'},
      {'si': 'මේස ගිණිසි', 'ta': 'மேज் खாও', 'en': 'Eat at table'}
    ]
  },
];
